# numpy
* https://numpy.org/learn/
* numpy: Nemerical Python 과학적, 산업적 연산을 위한 패키지 
* **다차원 배열, 행렬, 연산에 주로 사용**
* numpy는 pyhton의 list와 비슷한 자료형
* 순서가 있는 자료형
* 파이썬의 list와의 차이는 자료형이 1가지만 들어간다.
*

# 차원
* 0차원 = 점,  스칼라 a= 10
* 1차원 = 선 ------ 벡터, 배열, list, tuple,[1,2,3,4]
  * 벡터는 방향을 가진 데이터
* 2차원 = 면, 가로 세로, DB 테이블, Dataframe, matrix
* 3차원 = 입체, 가로, 세로, 깊이, 정육면체, 사진(RGB)
* 4차원 = 3차원 요소가 2개 이상
* 5차원 = 4차원요소가 2개 이상

In [3]:
import numpy as np

In [4]:
# 1차원 데이터
a = np.array([1,2,3,4,5])

In [21]:
s = 10
# 스칼라

* 차원을 출력하는 메서드 .ndim,
* 차원의 형태를 출력하는 메서드 .shape

In [22]:
# ndim
a.ndim

1

In [23]:
# 방향이 없는 벡터
#(5, )로 표기되는 것은 그렇게 표기하고 있고 다른 방향이 있는 것을 표기하기 위한 것임,
# 방향이 없음의 표기
a.shape

(5,)

In [24]:
# 2차원 데이터
c = np.array([[1,2,3,4,5],[6,7,8,9,10]])

In [25]:
c

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [9]:
c.ndim

2

In [11]:
c.shape
# 앞에가 행, 뒤에가 열

(2, 5)

In [13]:
# 3차원 데이터
d = np.array([[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]])
d

array([[[ 1,  2,  3,  4,  5],
        [ 6,  7,  8,  9, 10]],

       [[ 1,  2,  3,  4,  5],
        [ 6,  7,  8,  9, 10]]])

In [14]:
d.shape

(2, 2, 5)

In [16]:
# 4차원 데이터 
e = np.array([[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]],[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]]])
e

array([[[[ 1,  2,  3,  4,  5],
         [ 6,  7,  8,  9, 10]],

        [[ 1,  2,  3,  4,  5],
         [ 6,  7,  8,  9, 10]]],


       [[[ 1,  2,  3,  4,  5],
         [ 6,  7,  8,  9, 10]],

        [[ 1,  2,  3,  4,  5],
         [ 6,  7,  8,  9, 10]]]])

In [17]:
e.ndim

4

In [18]:
e.shape

(2, 2, 2, 5)

In [6]:
# 5차원 데이터
f = np.array([[[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]],[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]]],[[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]],[[[1,2,3,4,5],[6,7,8,9,10]],[[1,2,3,4,5],[6,7,8,9,10]]]]])
f

array([[[[[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]],

         [[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]]],


        [[[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]],

         [[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]]]],



       [[[[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]],

         [[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]]],


        [[[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]],

         [[ 1,  2,  3,  4,  5],
          [ 6,  7,  8,  9, 10]]]]])

In [7]:
f[1][0][1][1][1]

np.int64(7)

In [8]:
f[1][0][1][1][3:]

array([ 9, 10])

In [28]:
a2 = np.array([[1],[2],[3],[4],[5]])
a2

array([[1],
       [2],
       [3],
       [4],
       [5]])

In [29]:
a2.shape

(5, 1)

# 넘파이를 사용하는 이유
* 행렬연산이 쉽고 빠르기 때문

In [30]:
# 스칼라 연산
a = 10
b = 5
scalar = a+ b
print(scalar)

15

In [31]:
scalar+ 10

25

In [32]:
# 1차원 데이터 백터의 연산
b1 = [1,2,3,4,5]
# 리스트의 요소에 10을 곱한 후 다시 리스트로 만드세요.
result = []
for num in b1:
    result.append(num*10)
result

[10, 20, 30, 40, 50]

In [33]:
result2 = [num*10 for num in b1]
result2

[10, 20, 30, 40, 50]

In [35]:
# 2차원 데이터 계산 *10하기
second = np.array([[1,2,3],[1,2,3]])
print(second, second.ndim, second.shape)

[[1 2 3]
 [1 2 3]] 2 (2, 3)

In [108]:
result = []
for num in second:
    mid_result = []
    for number in num:
        mid_result.append(number * 10)
    result.append(mid_result)
result = np.array(result)

In [109]:
result.ndim

2

In [110]:
result.shape

(2, 3)

In [37]:
# 3차원 데이터의 요소에 10곱하기
third = np.array([[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]])
print(third, third.ndim, third.shape)

[[[1 2 3]
  [1 2 3]]

 [[1 2 3]
  [1 2 3]]] 3 (2, 2, 3)

In [111]:
result = []
for num1 in third:
    num1_result = []
    for num2 in num1:
        num2_result = []
        for num3 in num2:
            num2_result.append(num3 * 10)
        num1_result.append(num2_result)
    result.append(num1_result)
result = np.array(result)

In [112]:
result.ndim

3

In [113]:
result

array([[[10, 20, 30],
        [10, 20, 30]],

       [[10, 20, 30],
        [10, 20, 30]]])

In [42]:
# 4차원 데이터에 10곱하기
forth = np.array([[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]],[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]]])

In [43]:
forth * 10

array([[[[10, 20, 30],
         [10, 20, 30]],

        [[10, 20, 30],
         [10, 20, 30]]],


       [[[10, 20, 30],
         [10, 20, 30]],

        [[10, 20, 30],
         [10, 20, 30]]]])

In [10]:
# 5차원 데이터에 10 곱하기
fifth = np.array([[[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]],[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]]],[[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]],[[[1,2,3],[1,2,3]],[[1,2,3],[1,2,3]]]]])
print(fifth.ndim, fifth.shape)

5 (2, 2, 2, 2, 3)

In [11]:
fifth * 10

array([[[[[10, 20, 30],
          [10, 20, 30]],

         [[10, 20, 30],
          [10, 20, 30]]],


        [[[10, 20, 30],
          [10, 20, 30]],

         [[10, 20, 30],
          [10, 20, 30]]]],



       [[[[10, 20, 30],
          [10, 20, 30]],

         [[10, 20, 30],
          [10, 20, 30]]],


        [[[10, 20, 30],
          [10, 20, 30]],

         [[10, 20, 30],
          [10, 20, 30]]]]])

In [14]:
fifth[1] * 10

array([[[[10, 20, 30],
         [10, 20, 30]],

        [[10, 20, 30],
         [10, 20, 30]]],


       [[[10, 20, 30],
         [10, 20, 30]],

        [[10, 20, 30],
         [10, 20, 30]]]])

# numpy 에서 자주 사용하는 메서드
* .ndim: 몇 차원인지 보는 것
* .shape: 몇차원, 몇행, 몇열로 되어있는지 구조 확인
* .size: 배열안에 있는 요소의 총 개수가 몇 개인지
* .dtype: 데이터 타입이 무엇인지

In [49]:
fifth.ndim

5

In [50]:
fifth.shape

(2, 2, 2, 2, 3)

In [51]:
fifth.size

48

In [54]:
fifth.dtype
# 'int64', 'int32', 'int16'등의 표현식으로 나눔. 표현식의 범위에 따라 자료의 범위가 다르고, 용량이 커지기 때문에 최적화를 잘 해줘야함
# 'float64' 소수도 표현 가능함

dtype('int64')

# ndarray 만들기
* numpy의 기본 자료형 ndarray(n차원(demention)배열(array))
* np.array(리스트/튜플)
* 자료형은 반드시 한가지 자료형으로만 만든다.

In [56]:
e = np.array(1,2,3,4,5)

TypeError: array() takes from 1 to 2 positional arguments but 5 were given

In [55]:
print(*[1,2,3,4,5])

1 2 3 4 5

In [58]:
e = np.array([1,2,3,4,5])
e

array([1, 2, 3, 4, 5])

In [62]:
e2 = np.array([1,2,3.14,4,5])
print(e2)
e2.dtype

[1.   2.   3.14 4.   5.  ]

dtype('float64')

In [65]:
e3 = np.array([True,1,2,3,"4",5])
print(e3)
e3.dtype # 문자열 표기

['True' '1' '2' '3' '4' '5']

dtype('<U21')

### 타입을 잘 넣어야 바뀌지 않는다.

* np.arange(시작,끝, step)

In [67]:
a = np.arange(24)
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [69]:
a = np.arange(1,11,2)
a

array([1, 3, 5, 7, 9])

In [70]:
a2 = np.arange(11,1, -3)
a2

array([11,  8,  5,  2])

In [71]:
# 1-100까지 있는 array
a3 = np.arange(1, 101)
a3

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [74]:
# .reshape(행,열) 벡터를 원하는 크기의 matrix 또는 다차원 배열로 변환
print(a3.ndim)
print(a3.shape)
a4 = a3.reshape(20, 5)
print(a4.ndim)
print(a4.shape)

1
(100,)
2
(20, 5)

In [75]:
a5 = a3.reshape(5,4,5)
a5

array([[[  1,   2,   3,   4,   5],
        [  6,   7,   8,   9,  10],
        [ 11,  12,  13,  14,  15],
        [ 16,  17,  18,  19,  20]],

       [[ 21,  22,  23,  24,  25],
        [ 26,  27,  28,  29,  30],
        [ 31,  32,  33,  34,  35],
        [ 36,  37,  38,  39,  40]],

       [[ 41,  42,  43,  44,  45],
        [ 46,  47,  48,  49,  50],
        [ 51,  52,  53,  54,  55],
        [ 56,  57,  58,  59,  60]],

       [[ 61,  62,  63,  64,  65],
        [ 66,  67,  68,  69,  70],
        [ 71,  72,  73,  74,  75],
        [ 76,  77,  78,  79,  80]],

       [[ 81,  82,  83,  84,  85],
        [ 86,  87,  88,  89,  90],
        [ 91,  92,  93,  94,  95],
        [ 96,  97,  98,  99, 100]]])

In [ ]:
a6 = a3.reshape(25, )
print(a6.ndim)
print(a6.shape)

In [77]:
# fattren() : 다차원의 배열을 1차원으로 펼쳐줌
a5.flatten()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [79]:
a7 = np.arange(24)
a7 = a7.reshape(3,2,2,2)
a7

array([[[[ 0,  1],
         [ 2,  3]],

        [[ 4,  5],
         [ 6,  7]]],


       [[[ 8,  9],
         [10, 11]],

        [[12, 13],
         [14, 15]]],


       [[[16, 17],
         [18, 19]],

        [[20, 21],
         [22, 23]]]])

In [80]:
a7.ndim

4

In [81]:
a7.shape

(3, 2, 2, 2)

In [83]:
a72 = a7.flatten()
a72

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [84]:
a73 = a72.reshape(3,2,2,2)
a73

array([[[[ 0,  1],
         [ 2,  3]],

        [[ 4,  5],
         [ 6,  7]]],


       [[[ 8,  9],
         [10, 11]],

        [[12, 13],
         [14, 15]]],


       [[[16, 17],
         [18, 19]],

        [[20, 21],
         [22, 23]]]])

In [85]:
a73.ndim

4

### np.flip() 행렬의 순서를 뒤집을 때

In [86]:
np.flip(a73)

array([[[[23, 22],
         [21, 20]],

        [[19, 18],
         [17, 16]]],


       [[[15, 14],
         [13, 12]],

        [[11, 10],
         [ 9,  8]]],


       [[[ 7,  6],
         [ 5,  4]],

        [[ 3,  2],
         [ 1,  0]]]])

In [90]:
a73[::-1]

array([[[[16, 17],
         [18, 19]],

        [[20, 21],
         [22, 23]]],


       [[[ 8,  9],
         [10, 11]],

        [[12, 13],
         [14, 15]]],


       [[[ 0,  1],
         [ 2,  3]],

        [[ 4,  5],
         [ 6,  7]]]])

## np.linspace(시작, 끝, 구간 수): 정해진 숫자 범위 안에서 균등하게 구간을 나눌 때
* 반드시 시작과 끝은 입력수이다.

In [91]:
# np.linspace(시작, 끝, 구간 수): 정해진 숫자 범위 안에서 균등하게 구간을 나눌 때
np.linspace(1, 10, 10)

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [92]:
np.linspace(1, 10, 33)

array([ 1.     ,  1.28125,  1.5625 ,  1.84375,  2.125  ,  2.40625,
        2.6875 ,  2.96875,  3.25   ,  3.53125,  3.8125 ,  4.09375,
        4.375  ,  4.65625,  4.9375 ,  5.21875,  5.5    ,  5.78125,
        6.0625 ,  6.34375,  6.625  ,  6.90625,  7.1875 ,  7.46875,
        7.75   ,  8.03125,  8.3125 ,  8.59375,  8.875  ,  9.15625,
        9.4375 ,  9.71875, 10.     ])

In [93]:
np.linspace(1, 10, 539)

array([ 1.        ,  1.01672862,  1.03345725,  1.05018587,  1.0669145 ,
        1.08364312,  1.10037175,  1.11710037,  1.133829  ,  1.15055762,
        1.16728625,  1.18401487,  1.20074349,  1.21747212,  1.23420074,
        1.25092937,  1.26765799,  1.28438662,  1.30111524,  1.31784387,
        1.33457249,  1.35130112,  1.36802974,  1.38475836,  1.40148699,
        1.41821561,  1.43494424,  1.45167286,  1.46840149,  1.48513011,
        1.50185874,  1.51858736,  1.53531599,  1.55204461,  1.56877323,
        1.58550186,  1.60223048,  1.61895911,  1.63568773,  1.65241636,
        1.66914498,  1.68587361,  1.70260223,  1.71933086,  1.73605948,
        1.7527881 ,  1.76951673,  1.78624535,  1.80297398,  1.8197026 ,
        1.83643123,  1.85315985,  1.86988848,  1.8866171 ,  1.90334572,
        1.92007435,  1.93680297,  1.9535316 ,  1.97026022,  1.98698885,
        2.00371747,  2.0204461 ,  2.03717472,  2.05390335,  2.07063197,
        2.08736059,  2.10408922,  2.12081784,  2.13754647,  2.15427509,
        2.17100372,  2.18773234,  2.20446097,  2.22118959,  2.23791822,
        2.25464684,  2.27137546,  2.28810409,  2.30483271,  2.32156134,
        2.33828996,  2.35501859,  2.37174721,  2.38847584,  2.40520446,
        2.42193309,  2.43866171,  2.45539033,  2.47211896,  2.48884758,
        2.50557621,  2.52230483,  2.53903346,  2.55576208,  2.57249071,
        2.58921933,  2.60594796,  2.62267658,  2.6394052 ,  2.65613383,
        2.67286245,  2.68959108,  2.7063197 ,  2.72304833,  2.73977695,
        2.75650558,  2.7732342 ,  2.78996283,  2.80669145,  2.82342007,
        2.8401487 ,  2.85687732,  2.87360595,  2.89033457,  2.9070632 ,
        2.92379182,  2.94052045,  2.95724907,  2.9739777 ,  2.99070632,
        3.00743494,  3.02416357,  3.04089219,  3.05762082,  3.07434944,
        3.09107807,  3.10780669,  3.12453532,  3.14126394,  3.15799257,
        3.17472119,  3.19144981,  3.20817844,  3.22490706,  3.24163569,
        3.25836431,  3.27509294,  3.29182156,  3.30855019,  3.32527881,
        3.34200743,  3.35873606,  3.37546468,  3.39219331,  3.40892193,
        3.42565056,  3.44237918,  3.45910781,  3.47583643,  3.49256506,
        3.50929368,  3.5260223 ,  3.54275093,  3.55947955,  3.57620818,
        3.5929368 ,  3.60966543,  3.62639405,  3.64312268,  3.6598513 ,
        3.67657993,  3.69330855,  3.71003717,  3.7267658 ,  3.74349442,
        3.76022305,  3.77695167,  3.7936803 ,  3.81040892,  3.82713755,
        3.84386617,  3.8605948 ,  3.87732342,  3.89405204,  3.91078067,
        3.92750929,  3.94423792,  3.96096654,  3.97769517,  3.99442379,
        4.01115242,  4.02788104,  4.04460967,  4.06133829,  4.07806691,
        4.09479554,  4.11152416,  4.12825279,  4.14498141,  4.16171004,
        4.17843866,  4.19516729,  4.21189591,  4.22862454,  4.24535316,
        4.26208178,  4.27881041,  4.29553903,  4.31226766,  4.32899628,
        4.34572491,  4.36245353,  4.37918216,  4.39591078,  4.41263941,
        4.42936803,  4.44609665,  4.46282528,  4.4795539 ,  4.49628253,
        4.51301115,  4.52973978,  4.5464684 ,  4.56319703,  4.57992565,
        4.59665428,  4.6133829 ,  4.63011152,  4.64684015,  4.66356877,
        4.6802974 ,  4.69702602,  4.71375465,  4.73048327,  4.7472119 ,
        4.76394052,  4.78066914,  4.79739777,  4.81412639,  4.83085502,
        4.84758364,  4.86431227,  4.88104089,  4.89776952,  4.91449814,
        4.93122677,  4.94795539,  4.96468401,  4.98141264,  4.99814126,
        5.01486989,  5.03159851,  5.04832714,  5.06505576,  5.08178439,
        5.09851301,  5.11524164,  5.13197026,  5.14869888,  5.16542751,
        5.18215613,  5.19888476,  5.21561338,  5.23234201,  5.24907063,
        5.26579926,  5.28252788,  5.29925651,  5.31598513,  5.33271375,
        5.34944238,  5.366171  ,  5.38289963,  5.39962825,  5.41635688,
        5.4330855 ,  5.44981413,  5.46654275,  5.48327138,  5.5       ,
        5.51672862,  5.53345725,  5.55018587,  5.5669145 ,  5.58364312,
        5.60037175,  5.61710037,  5.633829  ,  5.65055762,  5.66728625,
        5.68401487,  5.70074349,  5.71747212,  5.73420074,  5.75092937,
        5.76765799,  5.78438662,  5.80111524,  5.81784387,  5.83457249,
        5.85130112,  5.86802974,  5.88475836,  5.90148699,  5.91821561,
        5.93494424,  5.95167286,  5.96840149,  5.98513011,  6.00185874,
        6.01858736,  6.03531599,  6.05204461,  6.06877323,  6.08550186,
        6.10223048,  6.11895911,  6.13568773,  6.15241636,  6.16914498,
        6.18587361,  6.20260223,  6.21933086,  6.23605948,  6.2527881 ,
        6.26951673,  6.28624535,  6.30297398,  6.3197026 ,  6.33643123,
        6.35315985,  6.36988848,  6.3866171 ,  6.40334572,  6.42007435,
        6.43680297,  6.4535316 ,  6.47026022,  6.48698885,  6.50371747,
        6.5204461 ,  6.53717472,  6.55390335,  6.57063197,  6.58736059,
        6.60408922,  6.62081784,  6.63754647,  6.65427509,  6.67100372,
        6.68773234,  6.70446097,  6.72118959,  6.73791822,  6.75464684,
        6.77137546,  6.78810409,  6.80483271,  6.82156134,  6.83828996,
        6.85501859,  6.87174721,  6.88847584,  6.90520446,  6.92193309,
        6.93866171,  6.95539033,  6.97211896,  6.98884758,  7.00557621,
        7.02230483,  7.03903346,  7.05576208,  7.07249071,  7.08921933,
        7.10594796,  7.12267658,  7.1394052 ,  7.15613383,  7.17286245,
        7.18959108,  7.2063197 ,  7.22304833,  7.23977695,  7.25650558,
        7.2732342 ,  7.28996283,  7.30669145,  7.32342007,  7.3401487 ,
        7.35687732,  7.37360595,  7.39033457,  7.4070632 ,  7.42379182,
        7.44052045,  7.45724907,  7.4739777 ,  7.49070632,  7.50743494,
        7.52416357,  7.54089219,  7.55762082,  7.57434944,  7.59107807,
        7.60780669,  7.62453532,  7.64126394,  7.65799257,  7.67472119,
        7.69144981,  7.70817844,  7.72490706,  7.74163569,  7.75836431,
        7.77509294,  7.79182156,  7.80855019,  7.82527881,  7.84200743,
        7.85873606,  7.87546468,  7.89219331,  7.90892193,  7.92565056,
        7.94237918,  7.95910781,  7.97583643,  7.99256506,  8.00929368,
        8.0260223 ,  8.04275093,  8.05947955,  8.07620818,  8.0929368 ,
        8.10966543,  8.12639405,  8.14312268,  8.1598513 ,  8.17657993,
        8.19330855,  8.21003717,  8.2267658 ,  8.24349442,  8.26022305,
        8.27695167,  8.2936803 ,  8.31040892,  8.32713755,  8.34386617,
        8.3605948 ,  8.37732342,  8.39405204,  8.41078067,  8.42750929,
        8.44423792,  8.46096654,  8.47769517,  8.49442379,  8.51115242,
        8.52788104,  8.54460967,  8.56133829,  8.57806691,  8.59479554,
        8.61152416,  8.62825279,  8.64498141,  8.66171004,  8.67843866,
        8.69516729,  8.71189591,  8.72862454,  8.74535316,  8.76208178,
        8.77881041,  8.79553903,  8.81226766,  8.82899628,  8.84572491,
        8.86245353,  8.87918216,  8.89591078,  8.91263941,  8.92936803,
        8.94609665,  8.96282528,  8.9795539 ,  8.99628253,  9.01301115,
        9.02973978,  9.0464684 ,  9.06319703,  9.07992565,  9.09665428,
        9.1133829 ,  9.13011152,  9.14684015,  9.16356877,  9.1802974 ,
        9.19702602,  9.21375465,  9.23048327,  9.2472119 ,  9.26394052,
        9.28066914,  9.29739777,  9.31412639,  9.33085502,  9.34758364,
        9.36431227,  9.38104089,  9.39776952,  9.41449814,  9.43122677,
        9.44795539,  9.46468401,  9.48141264,  9.49814126,  9.51486989,
        9.53159851,  9.54832714,  9.56505576,  9.58178439,  9.59851301,
        9.61524164,  9.63197026,  9.64869888,  9.66542751,  9.68215613,
        9.69888476,  9.71561338,  9.73234201,  9.74907063,  9.76579926,
        9.78252788,  9.79925651,  9.81598513,  9.83271375,  9.84944238,
        9.866171  ,  9.88289963,  9.89962825,  9.91635688,  9.9330855 ,
        9.94981413,  9.96654275,  9.98327138, 10.        ])

# 정렬, .sort(), sorted()
* 전체정렬

In [98]:
# 정렬, .sort(), sorted()
f = np.array([5,7,11,1,3,5,6,3,67,0,23,0.5])
f

array([ 5. ,  7. , 11. ,  1. ,  3. ,  5. ,  6. ,  3. , 67. ,  0. , 23. ,
        0.5])

In [97]:
# axis = -1 이 기본값
# axis = 1 은 2차원배열에서 각 열을 정렬합니다.

f.sort()

f

array([ 0. ,  0.5,  1. ,  3. ,  3. ,  5. ,  5. ,  6. ,  7. , 11. , 23. ,
       67. ])

In [ ]:
f.sort(order=True)

f

In [101]:
print(sorted(f, reverse=True))
f

[np.float64(67.0), np.float64(23.0), np.float64(11.0), np.float64(7.0), np.float64(6.0), np.float64(5.0), np.float64(5.0), np.float64(3.0), np.float64(3.0), np.float64(1.0), np.float64(0.5), np.float64(0.0)]

array([ 5. ,  7. , 11. ,  1. ,  3. ,  5. ,  6. ,  3. , 67. ,  0. , 23. ,
        0.5])

In [ ]:
f = np.array([5,7,11,1,3,5,6,3,67,0,23,0.5])
f

## argsort() 자료 중 값이 작은 것에서 큰 순으로 원래 인덱스 출력
* 부분정렬

In [102]:
g = np.array([5,0.5,-7,42,10,0])
print(g)

[ 5.   0.5 -7.  42.  10.   0. ]

In [ ]:
# 2, 5, 1, 0, 4, 3

In [105]:
s = g.argsort()
s

array([2, 5, 1, 0, 4, 3])

In [107]:
g[s][::-1]

array([42. , 10. ,  5. ,  0.5,  0. , -7. ])

추천시스템 만들때, ex) 영화, 금융상품
* 정렬해줌

* np.where(조건, 참, 거짓) 3항 연산

In [16]:
num = np.arange(1,11)
num

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [17]:
np.where(num %2 ==0, "짝수", "홀수")
# 3항 연산자

array(['홀수', '짝수', '홀수', '짝수', '홀수', '짝수', '홀수', '짝수', '홀수', '짝수'],
      dtype='<U2')

In [18]:
result = []
for i in num:
    if i % 2 ==0:
        "짝수"
        result.append('짝수')
    else:
        "홀수"
        result.append('홀수')
result

['홀수', '짝수', '홀수', '짝수', '홀수', '짝수', '홀수', '짝수', '홀수', '짝수']

# 배열 합치기 np.concatenate()

In [20]:
a = np.array([[1,2],[3,4]])
b = np.array([[5,6],[7,8]])
print(a, a.shape, a.ndim)
print(b, b.shape, b.ndim)

[[1 2]
 [3 4]] (2, 2) 2
[[5 6]
 [7 8]] (2, 2) 2

* np.concatenate((a,b))
* 합치는 기본 방향은 axis =0 행방향 아래로 붙음
* axis=1 열이 늘어남, 옆으로 붙음
* 붙이려는 행 두개는 데이터 수가 맞아야한다.

In [22]:
# axis=0 아래로 늘어나면서 합쳐짐
np.concatenate((a,b))

array([[1, 2],
       [3, 4],
       [5, 6],
       [7, 8]])

In [24]:
np.concatenate((a,b), axis= 1)
# 리스트 요소들이 합쳐짐, 즉 차원은 동일하게 유지하는 듯

array([[1, 2, 5, 6],
       [3, 4, 7, 8]])

# 합치는 방향의 모양이 일치하지 않으면 합치기 x

In [27]:
c = np.array([5,6])
print(c, c.ndim, c.shape)

[5 6] 1 (2,)

In [28]:
np.concatenate((a,c))

ValueError: all the input arrays must have same number of dimensions, but the array at index 0 has 2 dimension(s) and the array at index 1 has 1 dimension(s)

In [29]:
#차원이 맞지 않아서 합쳐지지 않음

In [33]:
d = np.array([[7,8,9]])

In [34]:
np.concatenate((a,d))

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 1, the array at index 0 has size 2 and the array at index 1 has size 3

In [36]:
e = np.array([[1,2,3],[4,5,6]])
print(e, e.ndim, e.shape)

[[1 2 3]
 [4 5 6]] 2 (2, 3)

In [37]:
np.concatenate((d,e))

array([[7, 8, 9],
       [1, 2, 3],
       [4, 5, 6]])

In [38]:
f = np.array([[1,2],[3,4],[5,6]])
print(f, f.ndim, f.shape)

[[1 2]
 [3 4]
 [5 6]] 2 (3, 2)

In [39]:
np.concatenate((e,f))

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 1, the array at index 0 has size 3 and the array at index 1 has size 2

In [41]:
np.concatenate((d,e),axis=1)

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 0, the array at index 0 has size 1 and the array at index 1 has size 2

# 전치 행렬 만들기
* .T
* .transpose()

In [44]:
# 전치행렬: 행과 열을 바꿈
print(f)
print(f.shape)
print(f.T)
print(f.T.shape)

[[1 2]
 [3 4]
 [5 6]]
(3, 2)
[[1 3 5]
 [2 4 6]]
(2, 3)

In [46]:
np.concatenate((e, f.T), axis=1)

array([[1, 2, 3, 1, 3, 5],
       [4, 5, 6, 2, 4, 6]])

In [ ]:
필기넣기

# 브로드캐스팅 
* 백터와 스칼라 , 혹은 매트릭스와 백터를 연산할 때 자동으로 행렬 크기를 맞춰주는 것

In [235]:
a = np.arange(1, 16).reshape(3,5)
a

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [236]:
a + 10

array([[11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [237]:
print(a, a.ndim, a.shape)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]] 2 (3, 5)

In [238]:
b = np.array([10, 20, 30, 40, 50])
print(b, b.ndim, b.shape)

[10 20 30 40 50] 1 (5,)

In [239]:
a + b

array([[11, 22, 33, 44, 55],
       [16, 27, 38, 49, 60],
       [21, 32, 43, 54, 65]])

In [48]:
import pandas as pd

In [49]:
df = pd.DataFrame(
    {"이름": ['홍길동','둘리','또치','도우너'],
    '주소': ['서울', '의정부', '고양', '성남'],
    '취미': ['음악감상', '놀기', '달리기', '바이올린']}
)

In [50]:
df

    이름   주소    취미
0  홍길동   서울  음악감상
1   둘리  의정부    놀기
2   또치   고양   달리기
3  도우너   성남  바이올린

In [51]:
df.shape

(4, 3)

In [52]:
df.ndim

2

In [54]:
df['이름'].dtype

dtype('O')

# Series 만들기
* pd.Series([리스트자료/튜플], name="컬럼명")
* 이름을 가지고 있는 리스트 혹은 백터4
* dataframe에서 컬럼 1개를 잘라온 형태

In [55]:
ages = pd.Series([22,23,35], name= "나이")

In [56]:
ages.dtype

dtype('int64')

In [57]:
ages[0:2]

0    22
1    23
Name: 나이, dtype: int64

In [58]:
ages[::-1]

2    35
1    23
0    22
Name: 나이, dtype: int64

In [59]:
ages.min(), ages.max()

(np.int64(22), np.int64(35))

In [60]:
ages.sum()

np.int64(80)

In [61]:
ages.mean()

np.float64(26.666666666666668)

In [62]:
ages.cunsum()

AttributeError: 'Series' object has no attribute 'cunsum'

In [63]:
ages.median()

np.float64(23.0)

# 판다스에서 자료 불러오기 저장하기
* csv, tsv, excel, json, html, sql
* pd.read_확장자명

excel 파일 불러오기

In [65]:
df_excel =pd.read_excel("./data/Online Retail.xlsx")
df_excel

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [73]:
df_excel2 = pd.read_excel("./data/아파트(매매)_실거래가_20240806113828.xlsx" , header=12, index_col=0, usecols=[1,2,3,4,5])
df_excel2
# openpyexcel 설치 필요

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\openpyxl\styles\stylesheet.py:237: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

                         번지    본번  부번                단지명
시군구
서울특별시 영등포구 당산동5가         42    42   0          당산삼성래미안4차
강원특별자치도 원주시 지정면 가곡리    1512  1512   0  원주롯데캐슬골드파크1차(5단지)
대구광역시 달성군 화원읍 구라리      1650  1650   0             대곡역래미안
광주광역시 남구 진월동          312-7   312   7                 광명
광주광역시 남구 진월동         331-93   331  93                 중흥
...                     ...   ...  ..                ...
서울특별시 송파구 장지동           849   849   0          송파파인타운3단지
부산광역시 사상구 모라동           552   552   0               백양그린
광주광역시 광산구 비아동         152-5   152   5                 호반
부산광역시 사상구 모라동           552   552   0               백양그린
대구광역시 북구 읍내동         1366-2  1366   2               칠곡보성

[37580 rows x 4 columns]

In [75]:
df_csv =pd.read_csv("./data/아파트(매매)_실거래가_20240806113828.csv", header=12)
df_csv

,NO,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),...,층,매수자,매도자,건축년도,도로명,해제사유발생일,거래유형,중개사소재지,등기일자,주택유형
0,1,서울특별시 영등포구 당산동5가,42,42,0,당산삼성래미안4차,115.7800,202407,31,"139,000",...,4,개인,개인,2003,당산로 214,-,직거래,-,-,아파트
1,2,강원특별자치도 원주시 지정면 가곡리,1512,1512,0,원주롯데캐슬골드파크1차(5단지),84.9644,202407,31,"38,900",...,10,개인,개인,2019,신지정로 250,20240802,중개거래,강원 원주시,-,아파트
2,3,대구광역시 달성군 화원읍 구라리,1650,1650,0,대곡역래미안,84.5958,202407,31,"29,500",...,11,개인,개인,2007,비슬로539길 35,-,중개거래,대구 달성군,-,아파트
3,4,광주광역시 남구 진월동,312-7,312,7,광명,70.6250,202407,31,"16,900",...,1,개인,개인,1998,광복마을길 63,-,중개거래,광주 남구,-,아파트
4,5,광주광역시 남구 진월동,331-93,331,93,중흥,84.8400,202407,31,"17,500",...,13,개인,개인,1992,서문대로749번마길 30,-,직거래,-,24.07.31,아파트
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37575,37576,서울특별시 송파구 장지동,849,849,0,송파파인타운3단지,84.9800,202407,1,"117,500",...,14,개인,개인,2008,충민로 152,-,중개거래,서울 송파구,-,아파트
37576,37577,부산광역시 사상구 모라동,552,552,0,백양그린,41.3000,202407,1,"7,000",...,8,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.10,아파트
37577,37578,광주광역시 광산구 비아동,152-5,152,5,호반,59.8800,202407,1,"15,400",...,5,개인,개인,1998,비아로 185,-,중개거래,광주 광산구,24.07.26,아파트
37578,37579,부산광역시 사상구 모라동,552,552,0,백양그린,41.3000,202407,1,"7,500",...,10,개인,개인,1992,모라로110번길 88,-,중개거래,부산 사상구,24.07.19,아파트
37579,37580,대구광역시 북구 읍내동,1366-2,1366,2,칠곡보성,84.9800,202407,1,"21,000",...,9,개인,개인,1992,구암로21길 26,-,중개거래,대구 북구,-,아파트

In [77]:
df_json = pd.read_json("./data/서울특별시_관광지입장정보_2011_2016.json")
df_json

    ForNum  NatNum  addrCd gungu      resNm  rnum   sido  yyyymm
0    44722   75991    1111   종로구        창덕궁     1  서울특별시  201112
1        0   11017    1111   종로구        운현궁     2  서울특별시  201112
2   132399  237330    1111   종로구        경복궁     3  서울특별시  201112
3     3133   21267    1111   종로구        창경궁     4  서울특별시  201112
4    18226   24223    1111   종로구         종묘     5  서울특별시  201112
..     ...     ...     ...   ...        ...   ...    ...     ...
62    5588   44232    1141  서대문구  서대문형무소역사관     8  서울특별시  201512
63       0   22587    1141  서대문구  서대문자연사박물관     9  서울특별시  201512
64   29520    8822    1144   마포구    트릭아이미술관    10  서울특별시  201512
65       3    1647    1165   서초구      헌릉ㆍ인릉    11  서울특별시  201512
66     492   14454    1168   강남구      선릉·정릉    12  서울특별시  201512

[67 rows x 8 columns]

In [83]:
df_HTML = pd.read_html("./data/corpList.htm")
df_HTML

[    Unnamed: 0                             Unnamed: 1  \
 0     한국제15호스팩                             금융 지원 서비스업
 1       에스오에스랩  측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외
 2   미래에셋비전스팩6호                             금융 지원 서비스업
 3   에이치엠씨제7호스팩                             금융 지원 서비스업
 4        파라다이스                     유원지 및 기타 오락관련 서비스업
 5       한중엔시에스      전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업
 6     KB제29호스팩                             금융 지원 서비스업
 7   미래에셋비전스팩5호                             금융 지원 서비스업
 8     씨어스테크놀로지                             의료용 기기 제조업
 9     한국제14호스팩                             금융 지원 서비스업
 10   디비금융스팩12호                                 기타 금융업
 11        라메디텍                             의료용 기기 제조업
 12       그리드위즈                 그외 기타 전문, 과학 및 기술 서비스업
 13       다원넥스뷰                        사진장비 및 광학기기 제조업
 14  미래에셋비전스팩4호                             금융 지원 서비스업

                                            Unnamed: 2  Unnamed: 3 Unnamed: 4  \
 0                                              기업인수합병  2024-06-26        12월
 1                                산업용 및 차량용 라이다(LiDAR)  2024-06-25        12월
 2                                              기업인수합병  2024-06-24        12월
 3                                                기타금융  2024-06-24        12월
 4                                      카지노, 호텔, 복합리조트  2024-06-24        12월
 5   수냉식 냉각시스템 ESS Parts, 공랭식 ESS Module Parts, EV ...  2024-06-24        12월
 6                                              기업인수합병  2024-06-21        12월
 7                                              기업인수합병  2024-06-19        12월
 8                                심전도검사솔루션 입원환자모니터링솔루션  2024-06-19        12월
 9                                              기업인수합병  2024-06-19        12월
 10                                          기업인수 및 합병  2024-06-18        12월
 11                                초소형 레이저 의료기기 및 미용기기  2024-06-17        12월
 12                             수요관리 서비스, 전기차 충전기 모뎀 등  2024-06-14        12월
 13                   LSMB(Laser Micro Bonding System)  2024-06-11        12월
 14                                  기업인수목적회사(기타금융서비스)  2024-05-29        12월

    Unnamed: 5 Unnamed: 6 Unnamed: 7
 0          유한        NaN      서울특별시
 1         정지성    홈페이지 보기      광주광역시
 2         정명훈        NaN      서울특별시
 3         강신명        NaN      서울특별시
 4       최종환..    홈페이지 보기      서울특별시
 5         김환식    홈페이지 보기       경상북도
 6         서영화        NaN      서울특별시
 7         김대호        NaN      서울특별시
 8         이영신    홈페이지 보기        경기도
 9         변성환        NaN      서울특별시
 10        김창희        NaN      서울특별시
 11        최종석        NaN      서울특별시
 12        김구환    홈페이지 보기        경기도
 13        남기중    홈페이지 보기        경기도
 14        김정수        NaN      서울특별시  ]

In [84]:
df_HTML[0]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,한국제15호스팩,금융 지원 서비스업,기업인수합병,2024-06-26,12월,유한,NaN,서울특별시
1,에스오에스랩,"측정, 시험, 항해, 제어 및 기타 정밀기기 제조업; 광학기기 제외",산업용 및 차량용 라이다(LiDAR),2024-06-25,12월,정지성,홈페이지 보기,광주광역시
2,미래에셋비전스팩6호,금융 지원 서비스업,기업인수합병,2024-06-24,12월,정명훈,NaN,서울특별시
3,에이치엠씨제7호스팩,금융 지원 서비스업,기타금융,2024-06-24,12월,강신명,NaN,서울특별시
4,파라다이스,유원지 및 기타 오락관련 서비스업,"카지노, 호텔, 복합리조트",2024-06-24,12월,최종환..,홈페이지 보기,서울특별시
5,한중엔시에스,"전동기, 발전기 및 전기 변환 · 공급 · 제어 장치 제조업","수냉식 냉각시스템 ESS Parts, 공랭식 ESS Module Parts, EV ...",2024-06-24,12월,김환식,홈페이지 보기,경상북도
6,KB제29호스팩,금융 지원 서비스업,기업인수합병,2024-06-21,12월,서영화,NaN,서울특별시
7,미래에셋비전스팩5호,금융 지원 서비스업,기업인수합병,2024-06-19,12월,김대호,NaN,서울특별시
8,씨어스테크놀로지,의료용 기기 제조업,심전도검사솔루션 입원환자모니터링솔루션,2024-06-19,12월,이영신,홈페이지 보기,경기도
9,한국제14호스팩,금융 지원 서비스업,기업인수합병,2024-06-19,12월,변성환,NaN,서울특별시
10,디비금융스팩12호,기타 금융업,기업인수 및 합병,2024-06-18,12월,김창희,NaN,서울특별시
11,라메디텍,의료용 기기 제조업,초소형 레이저 의료기기 및 미용기기,2024-06-17,12월,최종석,NaN,서울특별시
12,그리드위즈,"그외 기타 전문, 과학 및 기술 서비스업","수요관리 서비스, 전기차 충전기 모뎀 등",2024-06-14,12월,김구환,홈페이지 보기,경기도
13,다원넥스뷰,사진장비 및 광학기기 제조업,LSMB(Laser Micro Bonding System),2024-06-11,12월,남기중,홈페이지 보기,경기도
14,미래에셋비전스팩4호,금융 지원 서비스업,기업인수목적회사(기타금융서비스),2024-05-29,12월,김정수,NaN,서울특별시

In [85]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [87]:
engine = create_engine("mysql+pymysql://root:0308@localhost:3306/exchange_rate")
conn = engine.connect()
df_sql = pd.read_sql("exchange_rate", con=conn)
df_sql

,date,통화,현찰_사실_때_환율,현찰_사실_때_Spread,현찰_파실_때_환율,현찰_파실_때_Spread,송금_보낼_때_보낼_때,송금_받을_때_받을_때,외화_수표_파실때,매매_기준율,환가_료율,미화_환산율
0,2025-04-01,미국 USD,1497.25,1.75,1445.75,1.75,1485.90,1457.10,1454.58,1471.50,6.16937,1.0000
1,2025-04-01,일본 JPY (100),999.60,1.75,965.22,1.75,992.03,972.79,972.17,982.41,2.58136,0.6676
2,2025-04-01,유로 EUR,1620.77,1.99,1557.53,1.99,1605.04,1573.26,1571.36,1589.15,4.31900,1.0800
3,2025-04-01,중국 CNY,212.25,5.00,192.05,5.00,204.17,200.13,0.00,202.15,3.91894,0.1374
4,2025-04-01,홍콩 HKD,192.82,1.97,185.38,1.97,190.99,187.21,186.94,189.10,5.83533,0.1285
...,...,...,...,...,...,...,...,...,...,...,...,...
311540,2025-04-14,리비아 LYD,0.00,0.00,0.00,0.00,257.96,252.86,0.00,255.41,0.00000,0.1800
311541,2025-04-14,루마니아 RON,0.00,0.00,0.00,0.00,328.09,320.97,0.00,324.53,7.74933,0.2287
311542,2025-04-14,미얀마 MMK,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.68,0.00000,0.0005
311543,2025-04-14,에티오피아 ETB,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.69,0.00000,0.0075
311544,2025-04-14,우즈베키스탄 UZS,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.11,0.00000,0.0001

In [98]:
df_sql.tail(60)

,date,통화,현찰_사실_때_환율,현찰_사실_때_Spread,현찰_파실_때_환율,현찰_파실_때_Spread,송금_보낼_때_보낼_때,송금_받을_때_받을_때,외화_수표_파실때,매매_기준율,환가_료율,미화_환산율
311485,2025-04-10,에티오피아 ETB,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.98,0.00000,0.0076
311486,2025-04-10,우즈베키스탄 UZS,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.11,0.00000,0.0001
311487,2025-04-14,미국 USD,1444.13,1.75,1394.47,1.75,1433.20,1405.40,1402.97,1419.30,6.17186,1.0000
311488,2025-04-14,일본 JPY (100),1009.50,1.75,974.78,1.75,1001.86,982.42,981.79,992.14,2.59591,0.6990
311489,2025-04-14,유로 EUR,1647.74,1.99,1583.44,1.99,1631.74,1599.44,1597.50,1615.59,4.32600,1.1383
311490,2025-04-14,중국 CNY,203.94,5.00,184.52,5.00,196.17,192.29,0.00,194.23,4.00348,0.1368
311491,2025-04-14,홍콩 HKD,186.58,1.97,179.38,1.97,184.80,181.16,180.91,182.98,5.69033,0.1289
311492,2025-04-14,태국 THB,44.52,5.00,39.86,6.00,42.82,41.98,41.94,42.40,4.02533,0.0299
311493,2025-04-14,대만 TWD,49.52,13.10,39.42,10.00,0.00,0.00,0.00,43.79,3.58766,0.0309
311494,2025-04-14,필리핀 PHP,27.35,10.00,22.84,8.20,25.11,24.63,0.00,24.87,7.46900,0.0175
311495,2025-04-14,싱가포르 SGD,1101.00,1.99,1058.04,1.99,1090.31,1068.73,1067.47,1079.52,4.73666,0.7606
311496,2025-04-14,호주 AUD,916.91,1.97,881.49,1.97,908.19,890.21,888.68,899.20,6.23566,0.6336
311497,2025-04-14,베트남 VND (100),6.16,11.80,4.86,11.80,5.56,5.46,0.00,5.51,6.58166,0.0039
311498,2025-04-14,영국 GBP,1906.11,1.97,1832.47,1.97,1887.98,1850.60,1847.26,1869.29,6.53233,1.3171
311499,2025-04-14,캐나다 CAD,1045.82,1.97,1005.42,1.97,1035.87,1015.37,1014.03,1025.62,4.72566,0.7226
311500,2025-04-14,말레이시아 MYR,345.10,7.40,297.56,7.40,0.00,318.12,0.00,321.33,5.26033,0.2264
311501,2025-04-14,러시아 RUB,18.82,9.50,14.19,17.50,17.79,16.59,0.00,17.19,2.97500,0.0121
311502,2025-04-14,남아공화국 ZAR,81.19,8.00,69.17,8.00,76.08,74.28,0.00,75.18,9.58233,0.0530
311503,2025-04-14,노르웨이 NOK,138.94,3.30,126.85,5.70,135.85,133.17,132.93,134.51,6.45566,0.0948
311504,2025-04-14,뉴질랜드 NZD,851.34,1.97,818.46,1.97,843.24,826.56,825.28,834.90,5.64066,0.5882
311505,2025-04-14,덴마크 DKK,223.53,3.30,204.06,5.70,218.55,214.23,213.96,216.39,4.59600,0.1525
311506,2025-04-14,멕시코 MXN,77.58,10.50,62.84,10.50,70.91,69.51,0.00,70.21,11.81900,0.0495
311507,2025-04-14,몽골 MNT,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.40,13.47500,0.0003
311508,2025-04-14,바레인 BHD,4006.19,6.40,3464.01,8.00,3802.87,3727.57,3719.44,3765.22,7.77400,2.6529
311509,2025-04-14,방글라데시 BDT,0.00,0.00,0.00,0.00,0.00,0.00,0.00,11.68,12.18010,0.0082
311510,2025-04-14,브라질 BRL,266.63,10.20,217.77,10.00,0.00,239.06,0.00,241.96,14.44900,0.1705
311511,2025-04-14,브루나이 BND,1122.70,4.00,1014.75,6.00,0.00,0.00,0.00,1079.52,4.62500,0.7606
311512,2025-04-14,사우디아라비아 SAR,401.99,6.30,352.08,6.90,381.95,374.39,373.61,378.17,7.49400,0.2664
311513,2025-04-14,스리랑카 LKR,0.00,0.00,0.00,0.00,0.00,0.00,0.00,4.76,11.46666,0.0034
311514,2025-04-14,스웨덴 SEK,151.23,3.30,138.06,5.70,147.86,144.94,144.77,146.40,4.40233,0.1031
311515,2025-04-14,스위스 CHF,1771.54,1.97,1703.10,1.97,1754.69,1719.95,1718.85,1737.32,2.29300,1.2241
311516,2025-04-14,아랍에미리트공화국 AED,407.66,5.50,359.75,6.90,390.27,382.55,382.01,386.41,5.07500,0.2723
311517,2025-04-14,알제리 DZD,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.78,7.22500,0.0076
311518,2025-04-14,오만 OMR,3944.65,7.00,3428.53,7.00,0.00,0.00,0.00,3686.59,4.40500,2.5975
311519,2025-04-14,요르단 JOD,2179.99,8.90,1841.69,8.00,0.00,0.00,0.00,2001.83,8.73900,1.4104
311520,2025-04-14,이스라엘 ILS,423.53,10.00,354.23,8.00,0.00,0.00,0.00,385.03,6.56500,0.2713
311521,2025-04-14,이집트 EGP,0.00,0.00,0.00,0.00,0.00,0.00,0.00,27.86,7.22500,0.0196
311522,2025-04-14,인도 INR,0.00,0.00,0.00,0.00,16.69,16.33,0.00,16.51,9.03600,0.0116
311523,2025-04-14,인도네시아 IDR (100),9.32,10.00,7.64,10.00,8.56,8.40,8.39,8.48,8.42166,0.0060
311524,2025-04-14,체코 CZK,69.81,8.50,58.56,9.00,65.05,63.65,0.00,64.35,5.73500,0.0453
311525,2025-04-14,칠레 CLP,1.60,10.00,1.32,10.00,0.00,0.00,0.00,1.46,6.08300,0.0010
311526,2025-04-14,카자흐스탄 KZT,0.00,0.00,0.00,0.00,0.00,0.00,0.00,2.74,16.97500,0.0019
311527,2025-04-14,카타르 QAR,0.00,0.00,0.00,0.00,0.00,0.00,0.00,389.36,3.35500,0.2743
311528,2025-04-14,케냐 KES,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.96,9.77500,0.0077
311529,2025-04-14,콜롬비아 COP,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.33,0.00000,0.0002
311530,2025-04-14,쿠웨이트 KWD,4928.12,6.50,4257.17,8.00,4673.62,4581.08,4575.10,4627.35,4.65766,3.2603
311531,2025-04-14,탄자니아 TZS,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.53,10.30833,0.0004
311532,2025-04-14,튀르키예 TRY,0.00,0.00,0.00,0.00,37.77,36.95,0.00,37.36,51.57500,0.0263
311533,2025-04-14,파키스탄 PKR,0.00,0.00,0.00,0.00,0.00,0.00,0.00,5.06,17.74166,0.0036
311534,2025-04-14,폴란드 PLN,407.64,8.00,347.26,8.00,381.60,373.30,0.00,377.45,8.14600,0.2659
311535,2025-04-14,헝가리 HUF,4.30,9.30,3.63,8.00,3.98,3.90,0.00,3.94,8.43400,0.0028
311536,2025-04-14,네팔 NPR,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.31,0.00000,0.0073
311537,2025-04-14,마카오 MOP,0.00,0.00,0.00,0.00,0.00,0.00,0.00,177.52,0.00000,0.1251
311538,2025-04-14,캄보디아 KHR,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.35,0.00000,0.0002
311539,2025-04-14,피지 FJD,0.00,0.00,0.00,0.00,0.00,0.00,0.00,614.70,0.00000,0.4331
311540,2025-04-14,리비아 LYD,0.00,0.00,0.00,0.00,257.96,252.86,0.00,255.41,0.00000,0.1800
311541,2025-04-14,루마니아 RON,0.00,0.00,0.00,0.00,328.09,320.97,0.00,324.53,7.74933,0.2287
311542,2025-04-14,미얀마 MMK,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.68,0.00000,0.0005
311543,2025-04-14,에티오피아 ETB,0.00,0.00,0.00,0.00,0.00,0.00,0.00,10.69,0.00000,0.0075
311544,2025-04-14,우즈베키스탄 UZS,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.11,0.00000,0.0001

# 타이타닉 데이터셋으로 pandas 기능 익히기

In [88]:
df = pd.read_csv("./data/Titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* 데이터의 일부만 보기
* 앞쪽 head(행 갯수), 뒷쪽 tail(행 갯수)
* 기본값은 5개

In [89]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [90]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [95]:
df.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [101]:
# 데이터 프레임 각 컬럼의 데이터 타입
df.type()

AttributeError: 'DataFrame' object has no attribute 'type'

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [102]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

# .info()
* 컬럼명, null이 아닌 데이터 갯수, 데이터타입을 동시에 출력

# describe()
* 데이터프레임의 숫자 데이터의 기초통계를 보여주는 함수
* count, mean, std, min, 25%, 50%, 75%, max

In [103]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# 데이터 프레임에서 일부 컬럼만 가져오기
* loc: 인덱스 이름과 컬럼명으로 데이터의 일부를 추출해 가져옴
    * df.loc[시작 row 인덱스 : 끝 row 인덱스, ['컬럼명1','컬럼명2']
* iloc : 인덱스를 이용해 슬라이싱으로 데이터의 일부를 가져옴
    * df.iloc[시작row index : 끝 row index, 시작 column_index: 끝_column_index]

### loc[시작 row 인덱스 : 끝 row 인덱스, ['컬럼명1','컬럼명2']

In [106]:
df.loc[100 : 130, ['Name','Age']]

                                  Name   Age
100            Petranec, Miss. Matilda  28.0
101   Petroff, Mr. Pastcho ("Pentcho")   NaN
102          White, Mr. Richard Frasar  21.0
103         Johansson, Mr. Gustaf Joel  33.0
104     Gustafsson, Mr. Anders Vilhelm  37.0
105              Mionoff, Mr. Stoytcho  28.0
106   Salkjelsvik, Miss. Anna Kristine  21.0
107             Moss, Mr. Albert Johan   NaN
108                    Rekic, Mr. Tido  38.0
109                Moran, Miss. Bertha   NaN
110     Porter, Mr. Walter Chamberlain  47.0
111               Zabour, Miss. Hileni  14.5
112             Barton, Mr. David John  22.0
113            Jussila, Miss. Katriina  20.0
114              Attalah, Miss. Malake  17.0
115              Pekoniemi, Mr. Edvard  21.0
116               Connors, Mr. Patrick  70.5
117    Turpin, Mr. William John Robert  29.0
118           Baxter, Mr. Quigg Edmond  24.0
119  Andersson, Miss. Ellis Anna Maria   2.0
120        Hickman, Mr. Stanley George  21.0
121         Moore, Mr. Leonard Charles   NaN
122               Nasser, Mr. Nicholas  32.5
123                Webber, Miss. Susan  32.5
124        White, Mr. Percival Wayland  54.0
125       Nicola-Yarred, Master. Elias  12.0
126                McMahon, Mr. Martin   NaN
127          Madsen, Mr. Fridtjof Arne  24.0
128                  Peter, Miss. Anna   NaN
129                 Ekstrom, Mr. Johan  45.0
130               Drazenoic, Mr. Jozef  33.0

In [108]:
df.loc[101, ['Age']]

Age    NaN
Name: 101, dtype: object

In [110]:
df.loc[109, ['Age']] = 29

In [111]:
df.loc[109, ['Age']]

Age    29.0
Name: 109, dtype: object

In [115]:
display(df.loc[101:102, ['Name','Age']])
print(type(df.loc[101, ['Name','Age']]))

                                 Name   Age
101  Petroff, Mr. Pastcho ("Pentcho")   NaN
102         White, Mr. Richard Frasar  21.0

<class 'pandas.core.series.Series'>

### df.iloc[시작row index : 끝 row index, 시작 column_index: 끝_column_index]

In [117]:
df.iloc[0 : 10, 2:5]

   Pclass                                               Name     Sex
0       3                            Braund, Mr. Owen Harris    male
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2       3                             Heikkinen, Miss. Laina  female
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4       3                           Allen, Mr. William Henry    male
5       3                                   Moran, Mr. James    male
6       1                            McCarthy, Mr. Timothy J    male
7       3                     Palsson, Master. Gosta Leonard    male
8       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
9       2                Nasser, Mrs. Nicholas (Adele Achem)  female

In [119]:
df.iloc[4:, -5:]

     Parch      Ticket     Fare Cabin Embarked
4        0      373450   8.0500   NaN        S
5        0      330877   8.4583   NaN        Q
6        0       17463  51.8625   E46        S
7        1      349909  21.0750   NaN        S
8        2      347742  11.1333   NaN        S
..     ...         ...      ...   ...      ...
886      0      211536  13.0000   NaN        S
887      0      112053  30.0000   B42        S
888      2  W./C. 6607  23.4500   NaN        S
889      0      111369  30.0000  C148        C
890      0      370376   7.7500   NaN        Q

[887 rows x 5 columns]

In [ ]:
df.iloc[4, 4]

In [121]:
df.iloc[:10:2, ::-1]

,Embarked,Cabin,Fare,Ticket,Parch,SibSp,Age,Sex,Name,Pclass,Survived,PassengerId
0,S,NaN,7.2500,A/5 21171,0,1,22.0,male,"Braund, Mr. Owen Harris",3,0,1
2,S,NaN,7.9250,STON/O2. 3101282,0,0,26.0,female,"Heikkinen, Miss. Laina",3,1,3
4,S,NaN,8.0500,373450,0,0,35.0,male,"Allen, Mr. William Henry",3,0,5
6,S,E46,51.8625,17463,0,0,54.0,male,"McCarthy, Mr. Timothy J",1,0,7
8,S,NaN,11.1333,347742,2,0,27.0,female,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,1,9

특성파악후 분석 
* 특정 컬럼에서 유일값(중복되지 않은 고유한 값) 출력하기
* .unique()

In [123]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

* .nunique()
* 유일값의 개수를 출력
* Nan값은 무시

In [124]:
df['Embarked'].nunique()

3

* 카테고리 컬럼에서 유일값 별 개수를 세는 함수
* value_counts()

In [125]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [128]:
# ascending 옵션 value의 개수에 따라서 오름차순, 내림차순 정렬
df['Pclass'].value_counts(ascending=True)

Pclass
2    184
1    216
3    491
Name: count, dtype: int64

In [132]:
df['Age'].value_counts(sort=True)

Age
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
24.50     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

* 데이터를 정렬하는 함수
* sort_values(by="컬럼명")
* order by

In [135]:
df.sort_values(by="Age", ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

* 기준컬럼 2개로 정렬할 때

In [137]:
df.sort_values(by=["Age","Pclass"], ascending=False)
# 앞에 나온 것 기준으로 우선 정렬

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C

* 컬럼을 인덱스로 지정하기
* set_index("컬럼명")

In [140]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [141]:
df.set_index("PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [144]:
df = df.set_index("PassengerId")

KeyError: "None of ['PassengerId'] are in the columns"

In [145]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [150]:
df.loc[(889,'Johnston, Miss. Catherine Helen "Carrie"' ): (891, 'Dooley, Mr. Patrick'), ['Pclass','Name']]

AssertionError: Start slice bound is non-scalar

* 인덱스를 숫자로 초기화
* reset_index(drop=True)

In [153]:
df = df.reset_index()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [152]:
df.reset_index(drop=True)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* 컬럼 이름 쿨력하기, 바꾸기
* df.columns

In [154]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

* 컬럼이름 변경하기
* rename(columns={'원래이름':'새이름', 원래이름':'새이름'}):

In [157]:
df.rename(columns={'PassengerId':'Pid', 'Survived':'surv'}, inplace=True)

In [158]:
df

,Pid,surv,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* df.columns 로 출력되는 리스트 길이와 같은 새로운 이름의 리스트로 덮어쓰기

In [159]:
df.columns

Index(['Pid', 'surv', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [160]:
newName = ['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '형제자매수', '부모자식수',
       '티켓번호', '티켓가격', '선실번호', '목적지']

In [163]:
df.columns = newName
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자식수,티켓번호,티켓가격,선실번호,목적지
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

* 컬럼 추가하기
* 변수명['컬럼명'] = value

In [166]:
df['가족수']=0

In [169]:
df['가족수'] = df['형제자매수']+df['부모자식수']

In [171]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,형제자매수,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

* 컬럼 삭제하기
* del df['컬럼명']
* df.drop('컬럼명', axis=1,inplace=True )

In [172]:
del df['형제자매수']

In [173]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,0

In [174]:
df.drop('부모자식수')

KeyError: "['부모자식수'] not found in axis"

In [176]:
df.drop('부모자식수', axis=1)
df

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,0

In [177]:
df.drop(['이름', '승객번호'], axis=1)

     생존여부  선실등급      성별    나이  부모자식수              티켓번호     티켓가격  선실번호 목적지  가족수
0       0     3    male  22.0      0         A/5 21171   7.2500   NaN   S    1
1       1     1  female  38.0      0          PC 17599  71.2833   C85   C    1
2       1     3  female  26.0      0  STON/O2. 3101282   7.9250   NaN   S    0
3       1     1  female  35.0      0            113803  53.1000  C123   S    1
4       0     3    male  35.0      0            373450   8.0500   NaN   S    0
..    ...   ...     ...   ...    ...               ...      ...   ...  ..  ...
886     0     2    male  27.0      0            211536  13.0000   NaN   S    0
887     1     1  female  19.0      0            112053  30.0000   B42   S    0
888     0     3  female   NaN      2        W./C. 6607  23.4500   NaN   S    3
889     1     1    male  26.0      0            111369  30.0000  C148   C    0
890     0     3    male  32.0      0            370376   7.7500   NaN   Q    0

[891 rows x 10 columns]

In [178]:
df.columns

Index(['승객번호', '생존여부', '선실등급', '이름', '성별', '나이', '부모자식수', '티켓번호', '티켓가격',
       '선실번호', '목적지', '가족수'],
      dtype='object')

In [179]:
drop_cols = ['승객번호', '이름', '티켓번호', '티켓가격',
       '선실번호', '목적지', '가족수']

In [180]:
df

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,W./C. 6607,23.4500,NaN,S,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q,0

* 데이터 타입 바꾸기
* astype(자료형)
* apply(형변환 함수)

In [183]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   승객번호    891 non-null    int64
 1   생존여부    891 non-null    int64
 2   선실등급    891 non-null    int64
 3   이름      891 non-null    object
 4   성별      891 non-null    object
 5   나이      715 non-null    float64
 6   부모자식수   891 non-null    int64
 7   티켓번호    891 non-null    object
 8   티켓가격    891 non-null    float64
 9   선실번호    204 non-null    object
 10  목적지     889 non-null    object
 11  가족수     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [188]:
df['승객번호'] = df['승객번호'].astype('float')
df['승객번호']

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
       ...
886    887.0
887    888.0
888    889.0
889    890.0
890    891.0
Name: 승객번호, Length: 891, dtype: float64

In [191]:
df['승객번호'] = df['승객번호'].apply(str)
df.info()

람다 함수 조건표현식 너허어주면

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   승객번호    891 non-null    object
 1   생존여부    891 non-null    int64
 2   선실등급    891 non-null    int64
 3   이름      891 non-null    object
 4   성별      891 non-null    object
 5   나이      715 non-null    float64
 6   부모자식수   891 non-null    int64
 7   티켓번호    891 non-null    object
 8   티켓가격    891 non-null    float64
 9   선실번호    204 non-null    object
 10  목적지     889 non-null    object
 11  가족수     891 non-null    int64
dtypes: float64(2), int64(4), object(6)
memory usage: 83.7+ KB

# 판다스 데이터 프레임에서 조건에 맞는 행만 가져오기
* df[df['컬럼명'] 조건식]
* 조건식 연산자 <,<==,>,>=,==,!=,&,|

In [ ]:
df[df['승객번호'] == '홀수']

In [193]:
# 나이가 35 초과인사람만 필터링
df[df['나이'] > 35]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
6,7.0,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,17463,51.8625,E46,S,0
11,12.0,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,113783,26.5500,C103,S,0
13,14.0,0,3,"Andersson, Mr. Anders Johan",male,39.0,5,347082,31.2750,NaN,S,6
15,16.0,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,248706,16.0000,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
865,866.0,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,236852,13.0000,NaN,S,0
871,872.0,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,11751,52.5542,D35,S,2
873,874.0,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,345765,9.0000,NaN,S,0
879,880.0,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,11767,83.1583,C50,C,1
885,886.0,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,5,382652,29.1250,NaN,Q,5

* 여성이면서 나이가 35세 초과인 행 찾기 and조건

In [195]:
df[(df['성별'] == 'female')&(df['나이']> 35)]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
11,12.0,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,113783,26.5500,C103,S,0
15,16.0,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,248706,16.0000,NaN,S,0
25,26.0,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,5,347077,31.3875,NaN,S,6
40,41.0,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,0,7546,9.4750,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863.0,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,17466,25.9292,D17,S,0
865,866.0,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,236852,13.0000,NaN,S,0
871,872.0,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,11751,52.5542,D35,S,2
879,880.0,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,11767,83.1583,C50,C,1
885,886.0,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,5,382652,29.1250,NaN,Q,5

* 성별이 male, 선실등급 1, 생존여부 1인 사람을 찾으세요.

In [199]:
len(df[(df['성별'] == 'male') & (df['선실등급'] ==1) & (df['생존여부'] == 1)])

45

In [200]:
df[(df['성별'] == 'male') & (df['선실등급'] ==1) & (df['생존여부'] == 1)]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
23,24.0,1,1,"Sloper, Mr. William Thompson",male,28.00,0,113788,35.5000,A6,S,0
55,56.0,1,1,"Woolner, Mr. Hugh",male,NaN,0,19947,35.5000,C52,S,0
97,98.0,1,1,"Greenfield, Mr. William Bertram",male,23.00,1,PC 17759,63.3583,D10 D12,C,1
187,188.0,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.00,0,111428,26.5500,NaN,S,0
209,210.0,1,1,"Blank, Mr. Henry",male,40.00,0,112277,31.0000,A31,C,0
224,225.0,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.00,0,19943,90.0000,C93,S,1
248,249.0,1,1,"Beckwith, Mr. Richard Leonard",male,37.00,1,11751,52.5542,D35,S,2
298,299.0,1,1,"Saalfeld, Mr. Adolphe",male,NaN,0,19988,30.5000,C106,S,0
305,306.0,1,1,"Allison, Master. Hudson Trevor",male,0.92,2,113781,151.5500,C22 C26,S,3
370,371.0,1,1,"Harder, Mr. George Achilles",male,25.00,0,11765,55.4417,E50,C,1
390,391.0,1,1,"Carter, Mr. William Ernest",male,36.00,2,113760,120.0000,B96 B98,S,3
430,431.0,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28.00,0,110564,26.5500,C52,S,0
445,446.0,1,1,"Dodge, Master. Washington",male,4.00,2,33638,81.8583,A34,S,2
447,448.0,1,1,"Seward, Mr. Frederic Kimber",male,34.00,0,113794,26.5500,NaN,S,0
449,450.0,1,1,"Peuchen, Major. Arthur Godfrey",male,52.00,0,113786,30.5000,C104,S,0
453,454.0,1,1,"Goldenberg, Mr. Samuel L",male,49.00,0,17453,89.1042,C92,C,1
460,461.0,1,1,"Anderson, Mr. Harry",male,48.00,0,19952,26.5500,E12,S,0
484,485.0,1,1,"Bishop, Mr. Dickinson H",male,25.00,0,11967,91.0792,B49,C,1
507,508.0,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,111427,26.5500,NaN,S,0
512,513.0,1,1,"McGough, Mr. James Robert",male,36.00,0,PC 17473,26.2875,E25,S,0
550,551.0,1,1,"Thayer, Mr. John Borland Jr",male,17.00,2,17421,110.8833,C70,C,2
572,573.0,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.00,0,PC 17474,26.3875,E25,S,0
587,588.0,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.00,1,13567,79.2000,B41,C,2
599,600.0,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.00,0,PC 17485,56.9292,A20,C,1
604,605.0,1,1,"Homer, Mr. Harry (""Mr E Haven"")",male,35.00,0,111426,26.5500,NaN,C,0
607,608.0,1,1,"Daniel, Mr. Robert Williams",male,27.00,0,113804,30.5000,NaN,S,0
621,622.0,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.00,0,11753,52.5542,D19,S,1
630,631.0,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,27042,30.0000,A23,S,0
632,633.0,1,1,"Stahelin-Maeglin, Dr. Max",male,32.00,0,13214,30.5000,B50,C,0
645,646.0,1,1,"Harper, Mr. Henry Sleeper",male,48.00,0,PC 17572,76.7292,D33,C,1
647,648.0,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.00,0,13213,35.5000,A26,C,0
660,661.0,1,1,"Frauenthal, Dr. Henry William",male,50.00,0,PC 17611,133.6500,NaN,S,2
679,680.0,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.00,1,PC 17755,512.3292,B51 B53 B55,C,1
681,682.0,1,1,"Hassab, Mr. Hammad",male,27.00,0,PC 17572,76.7292,D49,C,0
690,691.0,1,1,"Dick, Mr. Albert Adrian",male,31.00,0,17474,57.0000,B20,S,1
701,702.0,1,1,"Silverthorne, Mr. Spencer Victor",male,35.00,0,PC 17475,26.2875,E24,S,0
707,708.0,1,1,"Calderhead, Mr. Edward Pennington",male,42.00,0,PC 17476,26.2875,E24,S,0
712,713.0,1,1,"Taylor, Mr. Elmer Zebley",male,48.00,0,19996,52.0000,C126,S,1
724,725.0,1,1,"Chambers, Mr. Norman Campbell",male,27.00,0,113806,53.1000,E8,S,1
737,738.0,1,1,"Lesurer, Mr. Gustave J",male,35.00,0,PC 17755,512.3292,B101,C,0
740,741.0,1,1,"Hawksford, Mr. Walter James",male,NaN,0,16988,30.0000,D45,S,0
802,803.0,1,1,"Carter, Master. William Thornton II",male,11.00,2,113760,120.0000,B96 B98,S,3
839,840.0,1,1,"Marechal, Mr. Pierre",male,NaN,0,11774,29.7000,C47,C,0
857,858.0,1,1,"Daly, Mr. Peter Denis",male,51.00,0,113055,26.5500,E17,S,0
889,890.0,1,1,"Behr, Mr. Karl Howell",male,26.00,0,111369,30.0000,C148,C,0

* 선실 등급별 승차권 금액의 최소, 최대, 평균 등 4분위수를 보고싶다.

In [204]:
# 선실 등급이 1등석인 사람들의 승차권 금액 통계량을 보고 싶다. 
df[df['선실등급']== 1]['티켓가격'].describe()

count    216.000000
mean      84.154687
std       78.380373
min        0.000000
25%       30.923950
50%       60.287500
75%       93.500000
max      512.329200
Name: 티켓가격, dtype: float64

In [205]:
df[df['티켓가격'] > 512]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
258,259.0,1,1,"Ward, Miss. Anna",female,35.0,0,PC 17755,512.3292,NaN,C,0
679,680.0,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,1,PC 17755,512.3292,B51 B53 B55,C,1
737,738.0,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,PC 17755,512.3292,B101,C,0

In [206]:
df[df['티켓가격'] == 0]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
179,180.0,0,3,"Leonard, Mr. Lionel",male,36.0,0,LINE,0.0,NaN,S,0
263,264.0,0,1,"Harrison, Mr. William",male,40.0,0,112059,0.0,B94,S,0
271,272.0,1,3,"Tornquist, Mr. William Henry",male,25.0,0,LINE,0.0,NaN,S,0
277,278.0,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,239853,0.0,NaN,S,0
302,303.0,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,LINE,0.0,NaN,S,0
413,414.0,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,239853,0.0,NaN,S,0
466,467.0,0,2,"Campbell, Mr. William",male,NaN,0,239853,0.0,NaN,S,0
481,482.0,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,239854,0.0,NaN,S,0
597,598.0,0,3,"Johnson, Mr. Alfred",male,49.0,0,LINE,0.0,NaN,S,0
633,634.0,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,112052,0.0,NaN,S,0
674,675.0,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,239856,0.0,NaN,S,0
732,733.0,0,2,"Knight, Mr. Robert J",male,NaN,0,239855,0.0,NaN,S,0
806,807.0,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,112050,0.0,A36,S,0
815,816.0,0,1,"Fry, Mr. Richard",male,NaN,0,112058,0.0,B102,S,0
822,823.0,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,19972,0.0,NaN,S,0

In [208]:
df[df['목적지'] == 'C']

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
9,10.0,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,0,237736,30.0708,NaN,C,1
19,20.0,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,2649,7.2250,NaN,C,0
26,27.0,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,2631,7.2250,NaN,C,0
30,31.0,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,PC 17601,27.7208,NaN,C,0
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867.0,1,2,"Duran y More, Miss. Asuncion",female,27.0,0,SC/PARIS 2149,13.8583,NaN,C,1
874,875.0,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,0,P/PP 3381,24.0000,NaN,C,1
875,876.0,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,2667,7.2250,NaN,C,0
879,880.0,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,11767,83.1583,C50,C,1
889,890.0,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0

# 조건에 맞는 행을 찾은 후 특정 컬럼만 조회하기
* 선실등급이 1이거나 2면서 생존한 여성 중에서 이름 컬럼만 보고 싶을 떄

In [214]:
df.loc[((df['선실등급']== 1) | (df['선실등급']== 2)) & (df['생존여부'] ==1) & (df['성별'] == 'female'),'이름']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 161, dtype: object

In [215]:
df[((df['선실등급']== 1) | (df['선실등급']== 2)) & (df['생존여부'] ==1) & (df['성별'] == 'female')]['이름']
# 이렇게 쓰는 것은 편법이다.

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
9                    Nasser, Mrs. Nicholas (Adele Achem)
11                              Bonnell, Miss. Elizabeth
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
874                Abelson, Mrs. Samuel (Hannah Wizosky)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
887                         Graham, Miss. Margaret Edith
Name: 이름, Length: 161, dtype: object

* 나이가 25세 미만이면서 생존자

In [220]:
df.loc[(df['나이']< 25) & (df['생존여부']== 1),'이름']

9           Nasser, Mrs. Nicholas (Adele Achem)
10              Sandstrom, Miss. Marguerite Rut
22                  McGowan, Miss. Anna "Annie"
39                  Nicola-Yarred, Miss. Jamila
43     Laroche, Miss. Simonne Marie Anne Andree
                         ...
855                  Aks, Mrs. Sam (Leah Rosen)
858       Baclini, Mrs. Solomon (Latifa Qurban)
869             Johnson, Master. Harold Theodor
875            Najib, Miss. Adele Kiamie "Jane"
887                Graham, Miss. Margaret Edith
Name: 이름, Length: 118, dtype: object

In [222]:
df[(df['나이']< 25) & (df['생존여부']== 1)]['이름']

9           Nasser, Mrs. Nicholas (Adele Achem)
10              Sandstrom, Miss. Marguerite Rut
22                  McGowan, Miss. Anna "Annie"
39                  Nicola-Yarred, Miss. Jamila
43     Laroche, Miss. Simonne Marie Anne Andree
                         ...
855                  Aks, Mrs. Sam (Leah Rosen)
858       Baclini, Mrs. Solomon (Latifa Qurban)
869             Johnson, Master. Harold Theodor
875            Najib, Miss. Adele Kiamie "Jane"
887                Graham, Miss. Margaret Edith
Name: 이름, Length: 118, dtype: object

In [223]:
df.나이

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: 나이, Length: 891, dtype: float64

.isin([조건1,조건2]) or 조건을 여러번 써야할 때 간단히 표현
* 선실등급을 1,2등인 사람을 추출

In [225]:
df[(df['선실등급']== 1) | (df['선실등급']== 2)]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
3,4.0,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S,1
6,7.0,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,17463,51.8625,E46,S,0
9,10.0,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,0,237736,30.0708,NaN,C,1
11,12.0,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,113783,26.5500,C103,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881.0,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,230433,26.0000,NaN,S,1
883,884.0,0,2,"Banfield, Mr. Frederick James",male,28.0,0,C.A./SOTON 34068,10.5000,NaN,S,0
886,887.0,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,0
887,888.0,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,0
889,890.0,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0

In [228]:
df[df['선실등급'].isin([1,2])]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
3,4.0,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,113803,53.1000,C123,S,1
6,7.0,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,17463,51.8625,E46,S,0
9,10.0,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,0,237736,30.0708,NaN,C,1
11,12.0,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,113783,26.5500,C103,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881.0,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,230433,26.0000,NaN,S,1
883,884.0,0,2,"Banfield, Mr. Frederick James",male,28.0,0,C.A./SOTON 34068,10.5000,NaN,S,0
886,887.0,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S,0
887,888.0,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S,0
889,890.0,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C,0

# 특정 단어를 포함한 행 찾기
* 이름에 Joseph 가 들어간 사람 찾기
* like %단어% -SQL 
* .str.contains("찾을단어")

In [232]:
df[df['이름'].str.contains("Joseph")]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
20,21.0,0,2,"Fynney, Mr. Joseph J",male,35.0,0,239865,26.0000,NaN,S,0
34,35.0,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,0,PC 17604,82.1708,NaN,C,1
95,96.0,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,374910,8.0500,NaN,S,0
140,141.0,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,2,2678,15.2458,NaN,C,2
145,146.0,0,2,"Nicholls, Mr. Joseph Charles",male,19.0,1,C.A. 33112,36.7500,NaN,S,2
194,195.0,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,PC 17610,27.7208,B4,C,0
375,376.0,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,0,PC 17604,82.1708,NaN,C,1
454,455.0,0,3,"Peduzzi, Mr. Joseph",male,NaN,0,A/5 2817,8.0500,NaN,S,0
532,533.0,0,3,"Elias, Mr. Joseph Jr",male,17.0,1,2690,7.2292,NaN,C,2
559,560.0,1,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,0,345572,17.4000,NaN,S,1
578,579.0,0,3,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,0,2689,14.4583,NaN,C,1
589,590.0,0,3,"Murdlin, Mr. Joseph",male,NaN,0,A./5. 3235,8.0500,NaN,S,0
608,609.0,1,2,"Laroche, Mrs. Joseph (Juliette Marie Louise La...",female,22.0,2,SC/Paris 2123,41.5792,NaN,C,3
685,686.0,0,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,2,SC/Paris 2123,41.5792,NaN,C,3
752,753.0,0,3,"Vande Velde, Mr. Johannes Joseph",male,33.0,0,345780,9.5000,NaN,S,0
828,829.0,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,0,367228,7.7500,NaN,Q,0

In [231]:
df['이름'].str.contains("Joseph")

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: 이름, Length: 891, dtype: bool

In [233]:
# 티켓번호에 PC라는 문자가 포함된 티켓을 필터링
df[df['티켓번호'].str.contains("PC")]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
1,2.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C,1
30,31.0,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,PC 17601,27.7208,NaN,C,0
31,32.0,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,0,PC 17569,146.5208,B78,C,1
34,35.0,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,0,PC 17604,82.1708,NaN,C,1
52,53.0,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,0,PC 17572,76.7292,D33,C,1
64,65.0,0,1,"Stewart, Mr. Albert A",male,NaN,0,PC 17605,27.7208,NaN,C,0
96,97.0,0,1,"Goldschmidt, Mr. George B",male,71.0,0,PC 17754,34.6542,A5,C,0
97,98.0,1,1,"Greenfield, Mr. William Bertram",male,23.0,1,PC 17759,63.3583,D10 D12,C,1
118,119.0,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,1,PC 17558,247.5208,B58 B60,C,1
139,140.0,0,1,"Giglio, Mr. Victor",male,24.0,0,PC 17593,79.2000,B86,C,0
155,156.0,0,1,"Williams, Mr. Charles Duane",male,51.0,1,PC 17597,61.3792,NaN,C,1
168,169.0,0,1,"Baumann, Mr. John D",male,NaN,0,PC 17318,25.9250,NaN,S,0
177,178.0,0,1,"Isham, Miss. Ann Elizabeth",female,50.0,0,PC 17595,28.7125,C49,C,0
194,195.0,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,PC 17610,27.7208,B4,C,0
195,196.0,1,1,"Lurette, Miss. Elise",female,58.0,0,PC 17569,146.5208,B80,C,0
256,257.0,1,1,"Thorne, Mrs. Gertrude Maybelle",female,NaN,0,PC 17585,79.2000,NaN,C,0
258,259.0,1,1,"Ward, Miss. Anna",female,35.0,0,PC 17755,512.3292,NaN,C,0
268,269.0,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,1,PC 17582,153.4625,C125,S,1
269,270.0,1,1,"Bissette, Miss. Amelia",female,35.0,0,PC 17760,135.6333,C99,S,0
273,274.0,0,1,"Natsch, Mr. Charles H",male,37.0,1,PC 17596,29.7000,C118,C,1
295,296.0,0,1,"Lewy, Mr. Ervin G",male,NaN,0,PC 17612,27.7208,NaN,C,0
299,300.0,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,1,PC 17558,247.5208,B58 B60,C,1
307,308.0,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,0,PC 17758,108.9000,C65,C,1
309,310.0,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,PC 17485,56.9292,E36,C,0
311,312.0,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,PC 17608,262.3750,B57 B59 B63 B66,C,4
325,326.0,1,1,"Young, Miss. Marie Grice",female,36.0,0,PC 17760,135.6333,C32,C,0
332,333.0,0,1,"Graham, Mr. George Edward",male,38.0,1,PC 17582,153.4625,C91,S,1
334,335.0,1,1,"Frauenthal, Mrs. Henry William (Clara Heinshei...",female,NaN,0,PC 17611,133.6500,NaN,S,1
369,370.0,1,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,PC 17477,69.3000,B35,C,0
373,374.0,0,1,"Ringhini, Mr. Sante",male,22.0,0,PC 17760,135.6333,NaN,C,0
375,376.0,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,0,PC 17604,82.1708,NaN,C,1
380,381.0,1,1,"Bidois, Miss. Rosalie",female,42.0,0,PC 17757,227.5250,NaN,C,0
493,494.0,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,PC 17609,49.5042,NaN,C,0
505,506.0,0,1,"Penasco y Castellana, Mr. Victor de Satode",male,18.0,0,PC 17758,108.9000,C65,C,1
512,513.0,1,1,"McGough, Mr. James Robert",male,36.0,0,PC 17473,26.2875,E25,S,0
513,514.0,1,1,"Rothschild, Mrs. Martin (Elizabeth L. Barrett)",female,54.0,0,PC 17603,59.4000,NaN,C,1
527,528.0,0,1,"Farthing, Mr. John",male,NaN,0,PC 17483,221.7792,C95,S,0
537,538.0,1,1,"LeRoy, Miss. Bertha",female,30.0,0,PC 17761,106.4250,NaN,C,0
544,545.0,0,1,"Douglas, Mr. Walter Donald",male,50.0,0,PC 17761,106.4250,C86,C,1
557,558.0,0,1,"Robbins, Mr. Victor",male,NaN,0,PC 17757,227.5250,NaN,C,0
572,573.0,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0,PC 17474,26.3875,E25,S,0
599,600.0,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,0,PC 17485,56.9292,A20,C,1
609,610.0,1,1,"Shutes, Miss. Elizabeth W",female,40.0,0,PC 17582,153.4625,C125,S,0
641,642.0,1,1,"Sagesser, Mlle. Emma",female,24.0,0,PC 17477,69.3000,B35,C,0
645,646.0,1,1,"Harper, Mr. Henry Sleeper",male,48.0,0,PC 17572,76.7292,D33,C,1
660,661.0,1,1,"Frauenthal, Dr. Henry William",male,50.0,0,PC 17611,133.6500,NaN,S,2
679,680.0,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,1,PC 17755,512.3292,B51 B53 B55,C,1
681,682.0,1,1,"Hassab, Mr. Hammad",male,27.0,0,PC 17572,76.7292,D49,C,0
700,701.0,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,0,PC 17757,227.5250,C62 C64,C,1
701,702.0,1,1,"Silverthorne, Mr. Spencer Victor",male,35.0,0,PC 17475,26.2875,E24,S,0
707,708.0,1,1,"Calderhead, Mr. Edward Pennington",male,42.0,0,PC 17476,26.2875,E24,S,0
710,711.0,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,PC 17482,49.5042,C90,C,0
716,717.0,1,1,"Endres, Miss. Caroline Louise",female,38.0,0,PC 17757,227.5250,C45,C,0
737,738.0,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,PC 17755,512.3292,B101,C,0
742,743.0,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,PC 17608,262.3750,B57 B59 B63 B66,C,4
789,790.0,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,PC 17593,79.2000,B82 B84,C,0
793,794.0,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,PC 17600,30.6958,NaN,C,0
835,836.0,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,PC 17756,83.1583,E49,C,2
853,854.0,1,1,"Lines, Miss. Mary Conover",female,16.0,1,PC 17592,39.4000,D28,S,1
867,868.0,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,PC 17590,50.4958,A24,S,0

In [234]:
df[df['티켓번호'].str.contains("C.A")]

,승객번호,생존여부,선실등급,이름,성별,나이,부모자식수,티켓번호,티켓가격,선실번호,목적지,가족수
33,34.0,0,2,"Wheadon, Mr. Edward H",male,66.0,0,C.A. 24579,10.5000,NaN,S,0
56,57.0,1,2,"Rugg, Miss. Emily",female,21.0,0,C.A. 31026,10.5000,NaN,S,0
58,59.0,1,2,"West, Miss. Constance Mirium",female,5.0,2,C.A. 34651,27.7500,NaN,S,3
66,67.0,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,C.A. 29395,10.5000,F33,S,0
70,71.0,0,2,"Jenkin, Mr. Stephen Curnow",male,32.0,0,C.A. 33111,10.5000,NaN,S,0
93,94.0,0,3,"Dean, Mr. Bertram Frank",male,26.0,2,C.A. 2315,20.5750,NaN,S,3
134,135.0,0,2,"Sobey, Mr. Samuel James Hayden",male,25.0,0,C.A. 29178,13.0000,NaN,S,0
145,146.0,0,2,"Nicholls, Mr. Joseph Charles",male,19.0,1,C.A. 33112,36.7500,NaN,S,2
161,162.0,1,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.0,0,C.A. 33595,15.7500,NaN,S,0
234,235.0,0,2,"Leyson, Mr. Robert William Norman",male,24.0,0,C.A. 29566,10.5000,NaN,S,0
237,238.0,1,2,"Collyer, Miss. Marjorie ""Lottie""",female,8.0,2,C.A. 31921,26.2500,NaN,S,2
265,266.0,0,2,"Reeves, Mr. David",male,36.0,0,C.A. 17248,10.5000,NaN,S,0
279,280.0,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,C.A. 2673,20.2500,NaN,S,2
348,349.0,1,3,"Coutts, Master. William Loch ""William""",male,3.0,1,C.A. 37671,15.9000,NaN,S,2
432,433.0,1,2,"Louch, Mrs. Charles Alexander (Alice Adelaide ...",female,42.0,0,SC/AH 3085,26.0000,NaN,S,1
439,440.0,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,C.A. 18723,10.5000,NaN,S,0
450,451.0,0,2,"West, Mr. Edwy Arthur",male,36.0,2,C.A. 34651,27.7500,NaN,S,3
472,473.0,1,2,"West, Mrs. Edwy Arthur (Ada Mary Worth)",female,33.0,2,C.A. 34651,27.7500,NaN,S,3
473,474.0,1,2,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",female,23.0,0,SC/AH Basle 541,13.7917,D,C,0
489,490.0,1,3,"Coutts, Master. Eden Leslie ""Neville""",male,9.0,1,C.A. 37671,15.9000,NaN,S,2
497,498.0,0,3,"Shellard, Mr. Frederick William",male,NaN,0,C.A. 6212,15.1000,NaN,S,0
516,517.0,1,2,"Lemore, Mrs. (Amelia Milley)",female,34.0,0,C.A. 34260,10.5000,F33,S,0
549,550.0,1,2,"Davies, Master. John Morgan Jr",male,8.0,1,C.A. 33112,36.7500,NaN,S,2
594,595.0,0,2,"Chapman, Mr. John Henry",male,37.0,0,SC/AH 29037,26.0000,NaN,S,1
637,638.0,0,2,"Collyer, Mr. Harvey",male,31.0,1,C.A. 31921,26.2500,NaN,S,2
672,673.0,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,C.A. 24580,10.5000,NaN,S,0
746,747.0,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,C.A. 2673,20.2500,NaN,S,2
788,789.0,1,3,"Dean, Master. Bertram Vere",male,1.0,2,C.A. 2315,20.5750,NaN,S,3
801,802.0,1,2,"Collyer, Mrs. Harvey (Charlotte Annie Tate)",female,31.0,1,C.A. 31921,26.2500,NaN,S,2
845,846.0,0,3,"Abbing, Mr. Anthony",male,42.0,0,C.A. 5547,7.5500,NaN,S,0
883,884.0,0,2,"Banfield, Mr. Frederick James",male,28.0,0,C.A./SOTON 34068,10.5000,NaN,S,0